#+title: Study

* Data Structures & Algorithms
** [[id:b4a820bc-0722-4dde-8b64-ad097b7b1f58][Graphs]]
:LOGBOOK:
CLOCK: [2024-09-16 Mon 07:58]--[2024-09-16 Mon 08:50] =>  0:52
:END:
** [[id:0739131a-6dbf-4033-889d-c5096cb44e81][Matrix]]
:LOGBOOK:
CLOCK: [2024-09-18 Wed 07:20]
:END:


* Languages
** F#
*** [-] [[id:b62df05a-56ae-416a-932f-868114759457][F# In Action]]
:LOGBOOK:
CLOCK: [2024-09-03 Tue 06:58]--[2024-09-03 Tue 07:37] =>  0:39
CLOCK: [2024-09-03 Tue 06:36]--[2024-09-03 Tue 06:48] =>  0:12
:END:
* Frontend
** [1/1] React
*** [X] React Quickly, Second Edition
